---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.RebarStyle
source: html/d44af128-695b-272f-d396-24618c0bb2dc.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.RebarStyle Property

Identifies the RebarStyle of the current Rebar element.

## Syntax (C#)
```csharp
public RebarStyle RebarStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration